MilanFranc/ESP32-audioI2S/src/Audio.cpp
    UrlParser urlParse;
    if (!urlParse.parse(host)) {
        audio_info("Hostaddress parsing error!");
        return false;
    }
    // Serial.print("proto:");
    // Serial.println(urlParse.protocol());
    // Serial.print("host:");
    // Serial.println(urlParse.host());
    // Serial.print("port:");
    // Serial.println(urlParse.port());
    // Serial.print("path:");
    // Serial.println(urlParse.path());

#if 0
    int p = utils::indexOf(l_host, "http", 0);
    if (p > 0) {
        if(audio_info) audio_info("Hostaddress is wrong");
        if(l_host) { free(l_host); l_host = NULL;}
        return false;
    }
    if (p < 0) { // http not found, then insert http://
        return false;
        // char* newHost = (char*) malloc(strlen(l_host) + 10);
        // strcpy(newHost, "http://");
        // strcat(newHost, l_host);
        // free(l_host);
        // l_host = newHost;
    }
#endif    

    setDefaults();

    AUDIO_INFO(sprintf(chbuf, "Connect to new host: \"%s\"", urlParse.host().c_str());)

    // authentification
    char* authorization = NULL;
    uint8_t authLen = strlen(user) + strlen(pwd);
    if (authLen > 0) {
        char toEncode[authLen + 4];
        strcpy(toEncode, user);
        strcat(toEncode, ":");
        strcat(toEncode, pwd);
        authorization = utils::b64encode((const char*)toEncode, strlen(toEncode));
    }

    // initializationsequence
    int16_t pos_slash;                                        // position of "/" in hostname
    int16_t pos_colon;                                        // position of ":" in hostname
    int16_t pos_ampersand;                                    // position of "&" in hostname
    uint16_t port = 80;                                       // port number
    m_f_webstream = true;
    setDatamode(AUDIO_HEADER);                                // Handle header

    if (urlParse.protocol() == "http") {
        m_f_ssl = false;
        _client = static_cast<WiFiClient*>(&client);
    }
    else if (urlParse.protocol() == "https") {
        m_f_ssl = true;
        _client = static_cast<WiFiClient*>(&clientsecure);
    }

    if (urlParse.port().length() > 0) {
        port = urlParse.port().toInt();
    }
    else { //port is empty
        port = (m_f_ssl) ? 443 : 80;
    }

#if 0
    if (utils::startsWith(l_host, "http://")) {
        h_host += 7;
    }
    else if (utils::startsWith(l_host, "https://")) {
        h_host += 8;
    }

    // Is it a playlist?
    if (utils::endsWith(h_host, ".m3u" ))       { m_playlistFormat = FORMAT_M3U;  m_datamode = AUDIO_PLAYLISTINIT; }
    if (utils::endsWith(h_host, ".pls" ))       { m_playlistFormat = FORMAT_PLS;  m_datamode = AUDIO_PLAYLISTINIT; }
    if (utils::endsWith(h_host, ".asx" ))       { m_playlistFormat = FORMAT_ASX;  m_datamode = AUDIO_PLAYLISTINIT; }
    // if url ...=asx   www.fantasyfoxradio.de/infusions/gr_radiostatus_panel/gr_radiostatus_player.php?id=2&p=asx
    if (utils::endsWith(h_host, "=asx" ))       { m_playlistFormat = FORMAT_ASX;  m_datamode = AUDIO_PLAYLISTINIT; }
    if (utils::endsWith(h_host, "=pls" ))       { m_playlistFormat = FORMAT_PLS;  m_datamode = AUDIO_PLAYLISTINIT; }
    // if url  "http://n3ea-e2.revma.ihrhls.com/zc7729/hls.m3u8?rj-ttl=5&rj-tok=AAABe8unpPAAyu36Dkm0J4mzJg"
    if (utils::indexOf(h_host, ".m3u8", 0) >10) { m_playlistFormat = FORMAT_M3U8; m_datamode = AUDIO_PLAYLISTINIT; }

    // In the URL there may be an extension, like noisefm.ru:8000/play.m3u&t=.m3u
    pos_slash     = utils::indexOf(h_host, "/", 0);
    pos_colon     = utils::indexOf(h_host, ":", 0);
    pos_ampersand = utils::indexOf(h_host, "&", 0);

    char *hostwoext = NULL;                                  // "skonto.ls.lv:8002" in "skonto.ls.lv:8002/mp3"
    char *extension = NULL;                                  // "/mp3" in "skonto.ls.lv:8002/mp3"

    if (pos_slash > 1) {
        uint8_t hostwoextLen = pos_slash;
        hostwoext = (char*)malloc(hostwoextLen + 1);
        memcpy(hostwoext, h_host, hostwoextLen);
        hostwoext[hostwoextLen] = '\0';
        uint16_t extLen =  utils::urlencode_expected_len(h_host + pos_slash);
        extension = (char *)malloc(extLen);
        memcpy(extension, h_host + pos_slash, extLen);
        utils::trim(extension);
        utils::urlencode(extension, extLen, true);
    }
    else {  // url has no extension
        hostwoext = strdup(h_host);
        extension = strdup("/");
    }

    if ((pos_colon >= 0) && ((pos_ampersand == -1) or (pos_ampersand > pos_colon))) {
        port = atoi(h_host + pos_colon + 1);// Get portnumber as integer
        hostwoext[pos_colon] = '\0';// Host without portnumber
    }
#endif

    AUDIO_INFO(sprintf(chbuf, "Connect to \"%s\" on port %d, extension \"%s\"", urlParse.host().c_str(), port, urlParse.path().c_str());)

    String httpRequest;
    uint16_t authorizationLen = authorization != NULL ? strlen(authorization) : 0;
    httpRequest.reserve(urlParse.host().length() + authorizationLen + 100);

    httpRequest += "GET ";
    httpRequest += urlParse.path();
    httpRequest += " HTTP/1.0\r\n";
    httpRequest += "Host: ";
    httpRequest += urlParse.host();
    httpRequest += "\r\n";
    httpRequest += "Icy-MetaData:1\r\n";
    if (authorization != NULL) {
        httpRequest += "Authorization: Basic ";
        httpRequest += authorization;
        httpRequest += "\r\n";
    }
    httpRequest += "User-Agent: Mozilla/5.0\r\n";
    httpRequest += "Connection: keep-alive\r\n";
    httpRequest += "\r\n";

    if (authorization != NULL) { free(authorization); authorization = NULL; } 

    bool result = false;
    uint32_t t = millis();

    //NOTE: maybe reconnect ??
    if (_client->connect(urlParse.host().c_str(), port, m_f_ssl ? m_timeout_ms_ssl : m_timeout_ms)) {
        if (!m_f_ssl) _client->setNoDelay(true);
        // if(audio_info) audio_info("SSL/TLS Connected to server");
        _client->print(httpRequest);
        uint32_t dt = millis() - t;
        AUDIO_INFO(sprintf(chbuf, "%s has been established in %u ms, free Heap: %u bytes", m_f_ssl?"SSL":"Connection", dt, ESP.getFreeHeap());)
        strcpy(m_lastHost, urlParse.host().c_str());
        m_f_running = result = true;
        while (!_client->connected()) {; } // wait until the connection is established
    }
    else {
        AUDIO_INFO(sprintf(chbuf, "Request %s failed!", urlParse.host().c_str()); )
        if (audio_showstation) audio_showstation("");
        if (audio_showstreamtitle) audio_showstreamtitle("");
        if (audio_icydescription) audio_icydescription("");
        if (audio_icyurl) audio_icyurl("");
     
