MilanFranc/ESP32-audioI2S/src/Audio.cpp
//---------------------------------------------------------------------------------------------------------------------
void Audio::processM3U8entries(uint8_t _nrOfEntries, uint32_t _seqNr, uint8_t _seqNrpos, uint16_t _targetDuration) {

    // call up the entries in m3u8 sequentially, after the last we need a new playlist
    static uint8_t  nrOfEntries = 0;
    static uint32_t currentSeqNr = 0;
    static uint32_t sequenceNr = 0;
    static uint32_t maxSeqNr = 0;
    static uint8_t  sequenceNrPos = 0;
    static uint16_t targetDuration = 0;

    char  resp[256 + 100];
    char* host = NULL;      // e.g  http://n31a-e2.revma.ihrhls.com
    char* extension = NULL; // e.g  hls.m3u8?rj-ttl=5&rj-tok=AAABe9D0_W0AmLAedXo_MfNpLw
    char* entryaddr = NULL;

     if (!m_f_m3u8data) {
        m_f_m3u8data = true;
        nrOfEntries = _nrOfEntries;
        currentSeqNr = _seqNr;
        sequenceNr = _seqNr;
        maxSeqNr = currentSeqNr + _nrOfEntries;
        sequenceNrPos = _seqNrpos;
        targetDuration = _targetDuration;
        connecttohost(m_playlistBuff + m_plsBuffEntryLen); // connect the streamserver first
        m_f_m3u8data = true; // connecttohost() will clear m_f_m3u8data, set it again

//        log_i("nrOfEntries=%d, currentSeqNr=%d, sequenceNrPos=%d targetDuration=%d", nrOfEntries, currentSeqNr, sequenceNrPos, targetDuration);
//        log_i("m3u8_url=%s", m_playlistBuff);
//        log_i("aac_url=%s", m_playlistBuff+ m_plsBuffEntryLen);

        (void)nrOfEntries;    // suppress warning -Wunused-but-set-variable
        (void)sequenceNr;
        (void)targetDuration;
        (void)resp;
        (void)host;
        (void)extension;

        currentSeqNr++;
        return;
    }

    if(_nrOfEntries == 0){ // processM3U8entries(0,0,0,0)
        if(currentSeqNr < maxSeqNr){ // next entry in playlist
            char sBuff[12];  itoa(currentSeqNr, sBuff,  10);
            entryaddr = m_playlistBuff + m_plsBuffEntryLen;
            memcpy(entryaddr + sequenceNrPos, sBuff, strlen(sBuff));
            // log_i("entryaddr=%s", entryaddr);
            goto label1;
        }
        if(currentSeqNr == maxSeqNr){ // we need a new playlist
            entryaddr = m_playlistBuff;
            // log_i("entryaddr=%s", entryaddr);


            goto label1;
        }
        if(currentSeqNr > maxSeqNr){
            return; // guard: in that case never goto label1:
        }
    }

    if(_nrOfEntries > 0){ // e.g. processM3U8entries(3,123456,55,10)

        while(currentSeqNr > _seqNr) {_seqNr++; _nrOfEntries--;} ;
        nrOfEntries = _nrOfEntries;
        maxSeqNr = currentSeqNr + _nrOfEntries;
        sequenceNrPos = _seqNrpos;
        targetDuration = _targetDuration;
        char sBuff[12];  itoa(currentSeqNr, sBuff,  10);
        entryaddr = m_playlistBuff + m_plsBuffEntryLen;
        memcpy(entryaddr + sequenceNrPos, sBuff, strlen(sBuff));
        //log_i("entryaddr=%s", entryaddr);

        goto label1;
    }

label1:

    httpRequest(entryaddr);

    if(currentSeqNr < maxSeqNr){
        m_datamode = AUDIO_HEADER;
        m_f_continue = true;
        currentSeqNr++;
    }
    else{
        m_datamode = AUDIO_PLAYLISTINIT;
        m_playlistFormat = FORMAT_M3U8;
    }
    m_f_Log = false;
    return;
}

#ifndef AUDIO_NO_SD_FS
//---------------------------------------------------------------------------------------------------------------------
void Audio::processLocalFile() {

    if(!(audiofile && m_f_running && m_f_localfile)) return;

    int bytesDecoded = 0;
    uint32_t bytesCanBeWritten = 0;
    uint32_t bytesCanBeRead = 0;
    int32_t bytesAddedToBuffer = 0;
    static bool f_stream;

    if(m_f_firstCall) {  // runs only one time per connection, prepare for start
        m_f_firstCall = false;
        f_stream = false;
        return;
    }

    if(!f_stream && m_controlCounter == 100) {
        f_stream = true;
        if(audio_info) audio_info("stream ready");
        if(m_resumeFilePos){
            if(m_resumeFilePos < m_audioDataStart) m_resumeFilePos = m_audioDataStart;
            if(m_avr_bitrate) m_audioCurrentTime = ((m_resumeFilePos - m_audioDataStart) / m_avr_bitrate) * 8;
            audiofile.seek(m_resumeFilePos);
            InBuff.resetBuffer();
            log_i("m_resumeFilePos %i", m_resumeFilePos);
        }
    }

    bytesCanBeWritten = InBuff.writeSpace();
    //----------------------------------------------------------------------------------------------------
    // some files contain further data after the audio block (e.g. pictures).
    // In that case, the end of the audio block is not the end of the file. An 'eof' has to be forced.
    if((m_controlCounter == 100) && (m_contentlength > 0)) { // fileheader was read
        if(bytesCanBeWritten + getFilePos() >= m_contentlength) {
            if(m_contentlength > getFilePos()) bytesCanBeWritten = m_contentlength - getFilePos();
            else bytesCanBeWritten = 0;
        }
    }
    //----------------------------------------------------------------------------------------------------

    bytesAddedToBuffer = audiofile.read(InBuff.getWritePtr(), bytesCanBeWritten);
    if (bytesAddedToBuffer > 0) {
        InBuff.bytesWritten(bytesAddedToBuffer);
    }

    if (bytesAddedToBuffer == -1) bytesAddedToBuffer = 0; // read error? eof?
    bytesCanBeRead = InBuff.bufferFilled();
    if (bytesCanBeRead > InBuff.getMaxBlockSize()) bytesCanBeRead = InBuff.getMaxBlockSize();
    if (bytesCanBeRead == InBuff.getMaxBlockSize()) { // mp3 or aac frame complete?

        if(m_controlCounter != 100){
            if(m_codec == CODEC_WAV){
                int res = read_WAV_Header(InBuff.getReadPtr(), bytesCanBeRead);
                if(res >= 0) bytesDecoded = res;
                else{ // error, skip header
                    m_controlCounter = 100;
                }
            }
            if(m_codec == CODEC_MP3){
                int res = read_MP3_Header(InBuff.getReadPtr(), bytesCanBeRead);
                if(res >= 0) bytesDecoded = res;
                else{ // error, skip header
                    m_controlCounter = 100;
                }
            }
            if(m_codec == CODEC_M4A){
                int res = read_M4A_Header(InBuff.getReadPtr(), bytesCanBeRead);
                if(res >= 0) bytesDecoded = res;
                else{ // error, skip header
                    m_controlCounter = 100;
                }
            }
            if(m_codec == CODEC_AAC){
                // stream only, no header
                m_audioDataSize = getFileSize();
                m_controlCounter = 100;
            }

