MilanFranc/ESP32-audioI2S/src/Audio.cpp
            if(m_codec == CODEC_FLAC){
                int res = read_FLAC_Header(InBuff.getReadPtr(), bytesCanBeRead);
                if(res >= 0) bytesDecoded = res;
                else{ // error, skip header
                    stopSong();
                    m_controlCounter = 100;
                }
            }
            if(!isRunning()){
                log_e("Processing stopped due to invalid audio header");
                return;
            }
        }
        else {
            bytesDecoded = sendBytes(InBuff.getReadPtr(), bytesCanBeRead);
        }
        if(bytesDecoded > 0) {InBuff.bytesWasRead(bytesDecoded); return;}
        if(bytesDecoded < 0) {  // no syncword found or decode error, try next chunk
            InBuff.bytesWasRead(200); // try next chunk
            m_bytesNotDecoded += 200;
            return;
        }
        return;
    }

    if(!bytesAddedToBuffer) {  // eof
        bytesCanBeRead = InBuff.bufferFilled();
        if(bytesCanBeRead > 200){
            if(bytesCanBeRead > InBuff.getMaxBlockSize()) bytesCanBeRead = InBuff.getMaxBlockSize();
            bytesDecoded = sendBytes(InBuff.getReadPtr(), bytesCanBeRead); // play last chunk(s)
            if(bytesDecoded > 0){
                InBuff.bytesWasRead(bytesDecoded);
                return;
            }
        }
        InBuff.resetBuffer();
        playI2Sremains();

        if(m_f_loop  && f_stream){  //eof
            AUDIO_INFO(sprintf(chbuf, "loop from: %u to: %u", getFilePos(), m_audioDataStart);) //TEST loop
            setFilePos(m_audioDataStart);
            if(m_codec == CODEC_FLAC) FLACDecoderReset();
            /*
                The current time of the loop mode is not reset,
                which will cause the total audio duration to be exceeded.
                For example: current time   ====progress bar====>  total audio duration
                                3:43        ====================>        3:33
            */
            m_audioCurrentTime = 0;
            return;
        } //TEST loop
        f_stream = false;
        m_f_localfile = false;

#ifdef SDFATFS_USED
        audiofile.getName(chbuf, sizeof(chbuf));
        char *afn =strdup(chbuf);
#else
        char *afn =strdup(audiofile.name()); // store temporary the name
#endif

        stopSong();
        if(m_codec == CODEC_MP3)   MP3Decoder_FreeBuffers();
        if(m_codec == CODEC_AAC)   AACDecoder_FreeBuffers();
        if(m_codec == CODEC_M4A)   AACDecoder_FreeBuffers();
        if(m_codec == CODEC_FLAC) FLACDecoder_FreeBuffers();
        AUDIO_INFO(sprintf(chbuf, "End of file \"%s\"", afn);)
        if(audio_eof_mp3) audio_eof_mp3(afn);
        if(afn) free(afn);
    }
}
#endif // AUDIO_NO_SD_FS
//---------------------------------------------------------------------------------------------------------------------
void Audio::processWebStream() {

    const uint16_t  maxFrameSize = InBuff.getMaxBlockSize();    // every mp3/aac frame is not bigger
    int32_t         availableBytes;                             // available bytes in stream
    static bool     f_tmr_1s;
    static bool     f_stream;                                   // first audio data received
    static int      bytesDecoded;
    static uint32_t byteCounter;                                // count received data
    static uint32_t chunksize;                                  // chunkcount read from stream
    static uint32_t tmr_1s;                                     // timer 1 sec
    static uint32_t loopCnt;                                    // count loops if clientbuffer is empty
    static uint32_t metacount;                                  // counts down bytes between metadata


    // first call, set some values to default - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_f_firstCall) { // runs only ont time per connection, prepare for start
        m_f_firstCall = false;
        f_stream = false;
        byteCounter = 0;
        chunksize = 0;
        bytesDecoded = 0;
        loopCnt = 0;
        tmr_1s = millis();
        m_t0 = millis();
        metacount = m_metaint;
        m_metaDecoder.reset();
    }
    if (m_f_continue) { // next m3u8 chunk is available
        byteCounter = 0;
        metacount = m_metaint;
        m_f_continue = false;
    }

    // have we reached the end of the webfile?  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_f_webfile && byteCounter == m_contentlength) {
        if (InBuff.bufferFilled() < 10000) {
            if (m_datamode == AUDIO_DATA && m_f_m3u8data) { processM3U8entries(); return; } // we need the next audioChunk
        }
        if (InBuff.bufferFilled() > 0) {
            if (InBuff.bufferFilled() == 128) { // post tag? comes sometimes after podcasts
                if (utils::indexOf((const char*)InBuff.getReadPtr(), "TAG", 0) == 0) {
                     log_i("%s", InBuff.getReadPtr() + 3);
                     InBuff.bytesWasRead(128);
                    return;
                }
                else {
                    log_v("%s", InBuff.getReadPtr());
                    InBuff.bytesWasRead(InBuff.bufferFilled());
                    return;
                }
            }
            bytesDecoded = sendBytes(InBuff.getReadPtr(), InBuff.bufferFilled());
            if(bytesDecoded > 0) { InBuff.bytesWasRead(bytesDecoded); return; }
            if(bytesDecoded == 0) return; // syncword at pos0 found
        }
        if (m_f_m3u8data) return;

        playI2Sremains();
        stopSong(); // Correct close when play known length sound #74 and before callback #112

        if (m_f_tts) {
            AUDIO_INFO(sprintf(chbuf, "End of speech: \"%s\"", m_lastHost);)
            if(audio_eof_speech) audio_eof_speech(m_lastHost);
        }
        else {
            AUDIO_INFO(sprintf(chbuf, "End of webstream: \"%s\"", m_lastHost);)
            if(audio_eof_stream) audio_eof_stream(m_lastHost);
        }
        return;
    }

    if (m_datamode != AUDIO_DATA) return;

