MilanFranc/ESP32-audioI2S/src/Audio.cpp
    // timer, triggers every second - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if ((tmr_1s + 1000) < millis()) {
        f_tmr_1s = true;                                        // flag will be set every second for one loop only
        tmr_1s = millis();
    }

    availableBytes = _client->available();      // available from stream

    if (ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_DEBUG) {
        // Here you can see how much data comes in, a summary is displayed in every 10 calls
        static uint8_t  i = 0;
        static uint32_t t = 0;
        static uint32_t t0 = 0;
        static uint16_t avb[10];
        if (!i) t = millis();
        avb[i] = availableBytes;
        if (!avb[i]) { if(!t0) t0 = millis(); }
        else { if(t0 && (millis() - t0) > 400) log_d("\033[31m%dms no data received", millis() - t0); t0 = 0; }
        i++;
        if (i == 10) i = 0;
        if (!i) {
            log_d("bytes available, 10 polls in %dms  %d, %d, %d, %d, %d, %d, %d, %d, %d, %d", millis() - t,
                   avb[0], avb[1], avb[2], avb[3], avb[4], avb[5], avb[6], avb[7], avb[8], avb[9]);
        }
    }

    // if we have chunked data transfer: get the chunksize- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_f_chunked && !m_chunkcount && availableBytes) { // Expecting a new chunkcount?
        int b;
        b = _client->read();

        if(b == '\r') return;
        if(b == '\n'){
            m_chunkcount = chunksize;
            chunksize = 0;
            if(m_f_tts){
                m_contentlength = m_chunkcount; // tts has one chunk only
                m_f_webfile = true;
                m_f_chunked = false;
            }
            return;
        }
        // We have received a hexadecimal character.  Decode it and add to the result.
        b = toupper(b) - '0';                       // Be sure we have uppercase
        if(b > 9) b = b - 7;                        // Translate A..F to 10..15
        chunksize = (chunksize << 4) + b;
        return;
    }

    // if we have metadata: get them - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (!metacount && !m_f_swm && availableBytes) {
        int16_t b = 0;
        b = _client->read();
        if(b >= 0) {
            if(m_f_chunked) m_chunkcount--;
            if(m_metaDecoder.addData(b)) metacount = m_metaint;
        }
        return;
    }

    // if the buffer is often almost empty issue a warning  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (InBuff.bufferFilled() < maxFrameSize && f_stream) {
        static uint8_t cnt_slow = 0;
        cnt_slow ++;
        if(f_tmr_1s) {
            if(cnt_slow > 25 && audio_info) audio_info("slow stream, dropouts are possible");
            f_tmr_1s = false;
            cnt_slow = 0;
        }
    }

    // if the buffer can't filled for several seconds try a new connection  - - - - - - - - - - - - - - - - - - - - - -
    if (f_stream && !availableBytes) {
        loopCnt++;
        if (loopCnt > 200000) {              // wait several seconds
            loopCnt = 0;

            if(audio_info) audio_info("Stream lost -> try new connection");
            connecttohost(m_lastHost);
        }
    }
    if (availableBytes) loopCnt = 0;

    // buffer fill routine  - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (true) { // statement has no effect
        uint32_t bytesCanBeWritten = InBuff.writeSpace();
        if (!m_f_swm)    bytesCanBeWritten = min(metacount,  bytesCanBeWritten);
        if (m_f_chunked) bytesCanBeWritten = min(m_chunkcount, bytesCanBeWritten);

        int16_t bytesAddedToBuffer = 0;

        if (InBuff.havePSRAM() && bytesCanBeWritten > 4096) bytesCanBeWritten = 4096; // PSRAM throttle

        if (m_f_webfile) {
            // normally there is nothing to do here, if byteCounter == contentLength
            // then the file is completely read, but:
            // m4a files can have more data  (e.g. pictures ..) after the audio Block
            // therefore it is bad to read anything else (this can generate noise)
            if (byteCounter + bytesCanBeWritten >= m_contentlength) bytesCanBeWritten = m_contentlength - byteCounter;
        }

        bytesAddedToBuffer = _client->read(InBuff.getWritePtr(), bytesCanBeWritten);

        if (bytesAddedToBuffer > 0) {
            if (m_f_webfile)             byteCounter  += bytesAddedToBuffer;  // Pull request #42
            if (!m_f_swm)                metacount  -= bytesAddedToBuffer;
            if (m_f_chunked)             m_chunkcount -= bytesAddedToBuffer;
            InBuff.bytesWritten(bytesAddedToBuffer);
        }

        if (InBuff.bufferFilled() > maxFrameSize && !f_stream) {  // waiting for buffer filled
            f_stream = true;  // ready to play the audio data
            uint16_t filltime = millis() - m_t0;
            if (audio_info) audio_info("stream ready");
            AUDIO_INFO(sprintf(chbuf, "buffer filled in %d ms", filltime);)
        }
        if (!f_stream) return;
    }

    // if we have a webfile, read the file header first - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if (m_f_webfile && m_controlCounter != 100 && !m_f_m3u8data) { // m3u8call, audiochunk has no header
        if (InBuff.bufferFilled() < maxFrameSize) return;

        if (m_codec == CODEC_WAV) {
           int res = read_WAV_Header(InBuff.getReadPtr(), InBuff.bufferFilled());
           if(res >= 0) bytesDecoded = res;
           else{stopSong(); return;}
        }
        else if (m_codec == CODEC_MP3) {
            int res = read_MP3_Header(InBuff.getReadPtr(), InBuff.bufferFilled());
            if (res >= 0) bytesDecoded = res;
            else {m_controlCounter = 100; } // error, skip header
        }
        else if (m_codec == CODEC_M4A) {
            int res = read_M4A_Header(InBuff.getReadPtr(), InBuff.bufferFilled());
            if (res >= 0) bytesDecoded = res;
            else { stopSong(); return; }
        }
        else if (m_codec == CODEC_FLAC) {
            int res = read_FLAC_Header(InBuff.getReadPtr(), InBuff.bufferFilled());
            if (res >= 0) bytesDecoded = res;
            else { stopSong(); return; } // error, skip header
        }
        else if (m_codec == CODEC_AAC) { // aac has no header
            m_controlCounter = 100;
            return;
        }
        InBuff.bytesWasRead(bytesDecoded);
        return;
    }

    // play audio data - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    if ((InBuff.bufferFilled() >= maxFrameSize) && (f_stream == true)) { // fill > framesize?
        if (m_f_webfile) {
                bytesDecoded = sendBytes(InBuff.getReadPtr(), maxFrameSize);
        }
        else { // not a webfile
            if (m_controlCounter != 100 && (m_codec == CODEC_OGG || m_codec == CODEC_OGG_FLAC)) {  //application/ogg
                int res = read_OGG_Header(InBuff.getReadPtr(), InBuff.bufferFilled());
                if (res >= 0) bytesDecoded = res;
                else { // error, skip header
                    stopSong();
                    m_controlCounter = 100;
                }
            }
            else {
                bytesDecoded = sendBytes(InBuff.getReadPtr(), maxFrameSize);
            }
        }
        if (bytesDecoded < 0) {  // no syncword found or decode error, try next chunk
            InBuff.bytesWasRead(200); // try next chunk
            m_bytesNotDecoded += 200;
            return;
        }
        else {
            InBuff.bytesWasRead(bytesDecoded);
        }
    }
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::processAudioHeaderData() {

    int av = 0;
    av= _client->available();
    if (av <= 0) return;

    char hl[512]; // headerline
    uint8_t b = 0;
    uint16_t pos = 0;
    int16_t idx = 0;
    static bool f_icyname = false;
    static bool f_icydescription = false;
    static bool f_icyurl = false;

    while(true) {
        b = _client->read();
        if(b == '\n') break;
        if(b == '\r') hl[pos] = 0;
        if(b < 0x20) continue;
        hl[pos] = b;
        pos++;
        if(pos == 510){
            hl[pos] = '\0';
            log_e("headerline overflow");
            break;
        }
    }

    if (!pos && m_f_ctseen) {  // audio header complete?
        m_datamode = AUDIO_DATA;                         // Expecting data now
        if(m_f_Log) { AUDIO_INFO(sprintf(chbuf, "Switch to DATA, metaint is %d", m_metaint);) }
        memcpy(chbuf, m_lastHost, strlen(m_lastHost)+1);
//        uint idx = indexOf(chbuf, "?", 0);
//        if(idx > 0) chbuf[idx] = 0;
        if(audio_lasthost) audio_lasthost(chbuf);
        if(!f_icyname){if(audio_showstation) audio_showstation("");}
        if(!f_icydescription){if(audio_icydescription) audio_icydescription("");}
        if(!f_icyurl){if(audio_icyurl) audio_icyurl("");}
        f_icyname = false;
        f_icydescription = false;
        f_icyurl = false;
        delay(50);  // #77
        return;
    }
    if (!pos) {
        stopSong();
        if(audio_showstation) audio_showstation("");
        if(audio_icydescription) audio_icydescription("");
        if(audio_icyurl) audio_icyurl("");
        f_icyname = false;
        f_icydescription = false;
        f_icyurl = false;
        log_e("can't see content in audioHeaderData");
        return;
    }

    AUDIO_INFO(sprintf(chbuf, "i:%s", hl);)

    idx = utils::indexOf(hl, ":", 0); // lowercase all letters up to the colon
    if (idx >= 0) {
        for(int i=0; i< idx; i++) {
            hl[i] = toLowerCase(hl[i]);
        }
    }

    if (utils::indexOf(hl, "HTTP/1.0 404", 0) >= 0) {
        m_f_running = false;
        stopSong();
        if(audio_info) audio_info("404 Not Found");
        return;
    }

