MilanFranc/ESP32-audioI2S/src/Audio.cpp
    }
    if (--metalen == 0) {
        if (strlen(chbuf)) {                             // Any info present?
            // metaline contains artist and song name.  For example:
            // "StreamTitle='Don McLean - American Pie';StreamUrl='';"
            // Sometimes it is just other info like:
            // "StreamTitle='60s 03 05 Magic60s';StreamUrl='';"
            // Isolate the StreamTitle, remove leading and trailing quotes if present.
            // log_i("ST %s", metaline);

            utils::latinToUTF8(chbuf, sizeof(chbuf)); // convert to UTF-8 if necessary

            int pos = utils::indexOf(chbuf, "song_spot", 0);    // remove some irrelevant infos
            if (pos > 3) {                                // e.g. song_spot="T" MediaBaseId="0" itunesTrackId="0"
                chbuf[pos] = 0;
            }
            if (!m_f_localfile) showstreamtitle(chbuf);   // Show artist and title if present in metadata
        }
        return true;
    }

    return false;// end_METADATA
}
#endif

//---------------------------------------------------------------------------------------------------------------------
bool Audio::parseContentType(const char* ct) {
    bool ct_seen = false;
    if (utils::indexOf(ct, "audio", 0) >= 0) {        // Is ct audio?
        ct_seen = true;                       // Yes, remember seeing this
        if (utils::indexOf(ct, "mpeg", 13) >= 0) {
            m_codec = CODEC_MP3;
            AUDIO_INFO(sprintf(chbuf, "%s, format is mp3", ct);) //ok is likely mp3
            if (!MP3Decoder_AllocateBuffers()) { m_f_running = false; stopSong(); return false; }
            AUDIO_INFO(sprintf(chbuf, "MP3Decoder has been initialized, free Heap: %u bytes", ESP.getFreeHeap());)
            InBuff.changeMaxBlockSize(m_frameSizeMP3);
        }
        else if (utils::indexOf(ct, "mp3", 13) >= 0) {
            m_codec = CODEC_MP3;
            AUDIO_INFO(sprintf(chbuf, "%s, format is mp3", ct);)
            if (!MP3Decoder_AllocateBuffers()) {m_f_running = false; stopSong(); return false;}
            AUDIO_INFO(sprintf(chbuf, "MP3Decoder has been initialized, free Heap: %u bytes", ESP.getFreeHeap());)
            InBuff.changeMaxBlockSize(m_frameSizeMP3);
        }
        else if (utils::indexOf(ct, "aac", 13) >= 0) {      // audio/x-aac
            m_codec = CODEC_AAC;
            if (m_f_Log) { AUDIO_INFO(sprintf(chbuf, "%s, format is aac", ct);) }
            if (!AACDecoder_IsInit()) {
                if(!AACDecoder_AllocateBuffers()) {m_f_running = false; stopSong(); return false;}
                AUDIO_INFO(sprintf(chbuf, "AACDecoder has been initialized, free Heap: %u bytes", ESP.getFreeHeap());)
                InBuff.changeMaxBlockSize(m_frameSizeAAC);
            }
        }
        else if (utils::indexOf(ct, "mp4", 13) >= 0) {      // audio/mp4a, audio/mp4a-latm
            m_codec = CODEC_M4A;
            if(m_f_Log) { AUDIO_INFO(sprintf(chbuf, "%s, format is aac", ct);) }
            if(!AACDecoder_IsInit()){
                if(!AACDecoder_AllocateBuffers()) {m_f_running = false; stopSong(); return false;}
                AUDIO_INFO(sprintf(chbuf, "AACDecoder has been initialized, free Heap: %u bytes", ESP.getFreeHeap());)
                InBuff.changeMaxBlockSize(m_frameSizeAAC);
            }
        }
        else if (utils::indexOf(ct, "m4a", 13) >= 0) {      // audio/x-m4a
            m_codec = CODEC_M4A;
            AUDIO_INFO(sprintf(chbuf, "%s, format is aac", ct);)
            if(!AACDecoder_IsInit()){
                if(!AACDecoder_AllocateBuffers()) {m_f_running = false; stopSong(); return false;}
                AUDIO_INFO(sprintf(chbuf, "AACDecoder has been initialized, free Heap: %u bytes", ESP.getFreeHeap());)
                InBuff.changeMaxBlockSize(m_frameSizeAAC);
            }
        }
        else if (utils::indexOf(ct, "wav", 13) >= 0) {      // audio/x-wav
            m_codec = CODEC_WAV;
            AUDIO_INFO(sprintf(chbuf, "%s, format is wav", ct);)
            InBuff.changeMaxBlockSize(m_frameSizeWav);
        }
        else if (utils::indexOf(ct, "ogg", 13) >= 0) {
            m_codec = CODEC_OGG;
            AUDIO_INFO(sprintf(chbuf, "ContentType %s found", ct);)
        }
        else if (utils::indexOf(ct, "flac", 13) >= 0) {     // audio/flac, audio/x-flac
            m_codec = CODEC_FLAC;
            AUDIO_INFO(sprintf(chbuf, "%s, format is flac", ct);)
            if (!psramFound()) {
                if(audio_info) audio_info("FLAC works only with PSRAM!");
                m_f_running = false;
                return false;
            }
            if (!FLACDecoder_AllocateBuffers()) { m_f_running = false; stopSong(); return false; }
            InBuff.changeMaxBlockSize(m_frameSizeFLAC);
            AUDIO_INFO(sprintf(chbuf, "FLACDecoder has been initialized, free Heap: %u bytes", ESP.getFreeHeap());)
        }
        else {
            m_f_running = false;
            AUDIO_INFO(sprintf(chbuf, "%s, unsupported audio format", ct);)
        }
    }
    else if (utils::indexOf(ct, "application", 0) >= 0) {  // Is ct application?
        ct_seen = true;                       // Yes, remember seeing this
        uint8_t pos = utils::indexOf(ct, "application", 0);
        if (utils::indexOf(ct, "ogg", 13) >= 0) {
            m_codec = CODEC_OGG;
            AUDIO_INFO(sprintf(chbuf, "ContentType %s found", ct + pos);)
        }
    }
    else {
        AUDIO_INFO(sprintf(chbuf, "ContentType %s found - unknown", ct); )        
    }

    return ct_seen;
}
//---------------------------------------------------------------------------------------------------------------------
#if 0
void Audio::showstreamtitle(const char* ml) {
    // example for ml:
    // StreamTitle='Oliver Frank - Mega Hitmix';StreamUrl='www.radio-welle-woerthersee.at';
    // or adw_ad='true';durationMilliseconds='10135';adId='34254';insertionType='preroll';

    int16_t idx1, idx2;
    uint16_t i = 0, hash = 0;

    AUDIO_INFO(sprintf(chbuf, "e:%s", ml); )        

