MilanFranc/ESP32-audioI2S/src/Audio.cpp
    idx1 = utils::indexOf(ml, "StreamTitle=", 0);
    if (idx1 >= 0) {                                                              // Streamtitle found
        idx2 = utils::indexOf(ml, ";", idx1);
        char *sTit;
        if (idx2 >= 0) { sTit = strndup(ml + idx1, idx2 + 1); sTit[idx2] = '\0'; }
        else             sTit = strdup(ml);

        while(i < strlen(sTit)) { hash += sTit[i] * i+1; i++; }

        if (m_streamTitleHash != hash) {
            m_streamTitleHash = hash;
            if(audio_info) audio_info(sTit);
            uint8_t pos = 12;                                                   // remove "StreamTitle="
            if(sTit[pos] == '\'') pos++;                                        // remove leading  \'
            if(sTit[strlen(sTit) - 1] == '\'') sTit[strlen(sTit) -1] = '\0';    // remove trailing \'
            if(audio_showstreamtitle) audio_showstreamtitle(sTit + pos);
        }
        free(sTit);
    }

    idx1 = utils::indexOf(ml, "StreamUrl=", 0);
    idx2 = utils::indexOf(ml, ";", idx1);
    if (idx1 >= 0 && idx2 > idx1) {                                              // StreamURL found
        uint16_t len = idx2 - idx1;
        char *sUrl;
        sUrl = strndup(ml + idx1, len + 1); sUrl[len] = '\0';

        while (i < strlen(sUrl)) { hash += sUrl[i] * i+1; i++; }
        if (m_streamTitleHash != hash) {
            m_streamTitleHash = hash;
            if(audio_info) audio_info(sUrl);
        }
        free(sUrl);
    }

    idx1 = utils::indexOf(ml, "adw_ad=", 0);
    if(idx1 >= 0){                                                              // Advertisement found
        idx1 = utils::indexOf(ml, "durationMilliseconds=", 0);
        idx2 = utils::indexOf(ml, ";", idx1);
        if(idx1 >= 0 && idx2 > idx1){
            uint16_t len = idx2 - idx1;
            char *sAdv;
            sAdv = strndup(ml + idx1, len + 1); sAdv[len] = '\0';
            if(audio_info) audio_info(sAdv);
            uint8_t pos = 21;                                                   // remove "StreamTitle="
            if(sAdv[pos] == '\'') pos++;                                        // remove leading  \'
            if(sAdv[strlen(sAdv) - 1] == '\'') sAdv[strlen(sAdv) -1] = '\0';    // remove trailing \'
            if(audio_commercial) audio_commercial(sAdv + pos);
            free(sAdv);
        }
    }
}
#endif

//---------------------------------------------------------------------------------------------------------------------
void Audio::showCodecParams() {
    // print Codec Parameter (mp3, aac) in audio_info()
    if (audio_info) {
        sprintf(chbuf,"Channels: %i", getChannels());
        audio_info(chbuf);
        sprintf(chbuf,"SampleRate: %i", getSampleRate());
        audio_info(chbuf);
        sprintf(chbuf,"BitsPerSample: %i", getBitsPerSample());
        audio_info(chbuf);
        if (getBitRate()) {
            sprintf(chbuf,"BitRate: %i", getBitRate());
            audio_info(chbuf);
        }
        else {
            audio_info("BitRate: N/A");
        }

        if (m_codec == CODEC_AAC || m_codec == CODEC_M4A){
            uint8_t answ;
            if ((answ = AACGetFormat()) < 4) {
                const char hf[4][8] = { "unknown", "ADTS", "ADIF", "RAW" };
                sprintf(chbuf, "AAC HeaderFormat: %s", hf[answ]);
                audio_info(chbuf);
            }
            if (answ == 1) { // ADTS Header
                const char co[2][23] = {"MPEG-4", "MPEG-2"};
                sprintf(chbuf, "AAC Codec: %s", co[AACGetID()]);
                audio_info(chbuf);
                if(AACGetProfile() <5){
                    const char pr[4][23] = {"Main", "LowComplexity", "Scalable Sampling Rate", "reserved"};
                    sprintf(chbuf, "AAC Profile: %s", pr[answ]);
                    audio_info(chbuf);
                }
            }
        }
    }
}
//---------------------------------------------------------------------------------------------------------------------
int Audio::findNextSync(uint8_t* data, size_t len) {
    // Mp3 and aac audio data are divided into frames. At the beginning of each frame there is a sync word.
    // The sync word is 0xFFF. This is followed by information about the structure of the frame.
    // Wav files have no frames
    // Return: 0 the synchronous word was found at position 0
    //         > 0 is the offset to the next sync word
    //         -1 the sync word was not found within the block with the length len

    int nextSync;
    static uint32_t swnf = 0;
    switch(m_codec)
    {
    case CODEC_WAV: m_f_playing = true; nextSync = 0; break;
    case CODEC_MP3: nextSync = MP3FindSyncWord(data, len); break;
    case CODEC_AAC: nextSync = AACFindSyncWord(data, len); break;
    case CODEC_M4A: AACSetRawBlockParams(0, 2,44100, 1); m_f_playing = true; nextSync = 0; break;
    case CODEC_FLAC: 
        FLACSetRawBlockParams(m_flacNumChannels,   m_flacSampleRate,
                              m_flacBitsPerSample, m_flacTotalSamplesInStream, m_audioDataSize);
        nextSync = FLACFindSyncWord(data, len);
        break;
    case CODEC_OGG_FLAC:
        FLACSetRawBlockParams(m_flacNumChannels,   m_flacSampleRate,
                              m_flacBitsPerSample, m_flacTotalSamplesInStream, m_audioDataSize);
        nextSync = FLACFindSyncWord(data, len);
        break;
    default:
        assert(false);
        break;
    }

    if (nextSync == -1) {
         if(audio_info && swnf == 0) audio_info("syncword not found");
         if(m_codec == CODEC_OGG_FLAC) {
             nextSync = len;
         }
         else {
             swnf++; // syncword not found counter, can be multimediadata
         }
     }
     if (nextSync == 0) {
         if (audio_info && swnf > 0) {
             sprintf(chbuf, "syncword not found %i times", swnf);
             audio_info(chbuf);
             swnf = 0;
         }
         else {
             if(audio_info) audio_info("syncword found at pos 0");
         }
     }
     if (nextSync > 0) {
         AUDIO_INFO(sprintf(chbuf, "syncword found at pos %i", nextSync);)
     }
     return nextSync;
}
//---------------------------------------------------------------------------------------------------------------------
int Audio::sendBytes(uint8_t* data, size_t len) {
    int bytesLeft;
    static bool f_setDecodeParamsOnce = true;
    int nextSync = 0;
    if (!m_f_playing) {
        f_setDecodeParamsOnce = true;
        nextSync = findNextSync(data, len);
        if(nextSync == 0) { m_f_playing = true;}
        return nextSync;
    }
    // m_f_playing is true at this pos
    bytesLeft = len;
    int ret = 0;
    int bytesDecoded = 0;
    if(m_codec == CODEC_WAV) { //copy len data in outbuff and set validsamples and bytesdecoded=len
        memmove(m_outBuff, data , len);
        if(getBitsPerSample() == 16) m_validSamples = len / (2 * getChannels());
        if(getBitsPerSample() == 8 ) m_validSamples = len / 2;
        bytesLeft = 0;
    }

    switch(m_codec)
    {
    case CODEC_MP3: ret = MP3Decode(data, &bytesLeft, m_outBuff, 0); break;
    case CODEC_AAC: ret = AACDecode(data, &bytesLeft, m_outBuff); break;
    case CODEC_M4A: ret = AACDecode(data, &bytesLeft, m_outBuff); break;
    case CODEC_FLAC: ret = FLACDecode(data, &bytesLeft, m_outBuff); break;
    case CODEC_OGG_FLAC: ret = FLACDecode(data, &bytesLeft, m_outBuff); // FLAC webstream wrapped in OGG
    default:
        assert(false);
    }

    bytesDecoded = len - bytesLeft;
    if (ret == 0 && bytesDecoded == 0) { // unlikely framesize
        if(audio_info) audio_info("framesize is 0, start decoding again");
            m_f_playing = false; // seek for new syncword
        // we're here because there was a wrong sync word
        // so skip two sync bytes and seek for next
        return 1;
    }
    else if (ret < 0) { // Error, skip the frame...
        //if(m_codec == CODEC_M4A){log_i("begin not found"); return 1;}
        i2s_zero_dma_buffer((i2s_port_t)m_i2s_num);
        if (!getChannels() && (ret == -2)) {
             ; // suppress errorcode MAINDATA_UNDERFLOW
        }
        else {
            printDecodeError(ret);
            m_f_playing = false; // seek for new syncword
        }
        if (!bytesDecoded) bytesDecoded = 2;
        return bytesDecoded;
    }
    else {  // ret>=0
        if (f_setDecodeParamsOnce) {
            f_setDecodeParamsOnce = false;
            m_PlayingStartTime = millis();

